SDK/Tests/Resources/Salesforce.xml

<?xml version = "1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Body>
    <notifications xmlns = "http://soap.sforce.com/2005/09/outbound" >
      <OrganizationId > 00D0Y000000rcS3UAI</OrganizationId>
      <ActionId>04k0Y000000TNNxQAO</ActionId>
      <SessionId>00D0Y000000rcS3!AQQAQCfVErLKLSUF9UvRyujg0QFM38EtNBMn3luV9FbVrtVCUcN.kkdU17oA1Ibv.1fKN__.srh2HQ3X40DWNM63sNNOH7Oe</SessionId>
      <EnterpriseUrl>https://eu11.salesforce.com/services/Soap/c/38.0/00D0Y000000rcS3</EnterpriseUrl>
      <PartnerUrl>https://eu11.salesforce.com/services/Soap/u/38.0/00D0Y000000rcS3</PartnerUrl>
      <Notification>
        <Id>04l0Y000000LDo1QAG</Id>
        <sObject xsi:type="sf:Account" xmlns:sf="urn:sobject.enterprise.soap.sforce.com">
          <sf:Id>0010Y00000Ck8ptQAB</sf:Id>
          <sf:AccountNumber>1</sf:AccountNumber>
          <sf:CreatedDate>2017-01-12T10:10:50.000Z</sf:CreatedDate>
          <sf:Name>HookTester</sf:Name>
        </sObject>
      </Notification>
    </notifications>
  </soapenv:Body>
</soapenv:Envelope>